{
  "hostedAt": "Gehostet",
  "internal": "Weil dieses Projekt als vertraulich eingestuft wurde darf ich leider keinen öffentlichen Link zum Projekt bereitstellen.",
  "notActive": "Zurzeit nicht Verfügbar",
  "SNA": {
    "name": "Tobis Twitter Netzwerk",
    "text": "Dies ist ein Projekt welches ich im Zuge des Kurses 'Social Network Analysis' zusammen mit Christopher Lohse durchgeführt habe. Wir haben uns die Frage gestellt: 'Welche Twitter Accounts beeinflussen meinen Feed am meisten?'. Um diese Frage zu beantworten haben wir Methoden der Social Network Analyse benutzt. In diesem Projekt erweiterte ich meine Kentnisse in Python und Jupyter Notebook und lernte zusätzlich noch die Methoden der Social Network Analyse kennen.",
    "alt": "Social Network Graph"
  },
  "MyHome": {
    "name": "Meine Homepage",
    "text": "Meine Homepage habe ich entwickelt um mich mit ihrer Hilfe bei IBM für ein Duales Studium zu bewerben. Zum Glück habe ich den Job auch bekommen, vielleicht hat mir die Homepage dabei geholfen. Auf meiner Homepage stelle ich mich selbst der weiten Welt vor. Einen eigenen Blog habe ich dort auch, welchen ich selbst geschrieben habe. Die Website zu entwickeln war großartig, ich habe sehr viel über Webentwicklung lernen können. Außerdem konnte ich viel über Cloudentwicklung lernen, da ich die Homepage zuerst auf meinem Raspberry Pi und später auf der IBM Cloud gehostet habe.",
    "alt": "Screenshot meiner Homepage"
  },
  "ReactPrasi": {
    "name": "React Präsentation",
    "text": "Meine Freunde Christopher Lohse, Philipp Wussow und ich haben diese Seite als Webseite für eine Präsentation über das Framework React entwickelt. Wir wollten zeigen wie einfach es ist mit Frameworks eine gutaussehende Website zu entwickeln.",
    "alt": "Screenshot der Präsentation"
  },
  "CCT": {
    "name": "Cupboard Configuration Tool (CCT)",
    "text": "Den CCT habe ich zusammen mit meinen Freunden Christopher Lohse, Philipp Wussow, Ole Ofterdinger und Amon Schneider entwickelt. Dieses Projekt entstand im Zuge einer Projektsimulation. Bei dieser Simulation hatten verschiedene Teams aus dem Kurs die Aufgabe einen Online-Shop zu entwickeln unter weiteren verschiedenen Bedingungen. Zum Beispiel, dass unsere Dozenten für die Projektdauer in die Kundenrolle wechselten. In diesem Projekt vervollständigte ich mein Wissen über Webentwicklung durch das erlernen neuer Technologieen wie zum Beispiel i18n oder PWA.",
    "alt": "Screenshot des CCTs"
  },
  "DSVIZ": {
    "name": "Flights Dashboard",
    "text": "Zusammen mit Philipp Wussow habe ich dieses kleine Dashboard entwickelt, welches auf die Flugdaten aus Amerika im Jahre 2015 zugreift. Das Dashboard entstand im Zuge des Kurses 'Data Science Visualizations' als Prüfungsabgabe. Hier lernte ich vorallem mit Karten-Visualisierungen umzugehen.",
    "alt": "Screenshot des Dahboards"
  },
  "MyPort": {
    "name": "Mein Portfolio",
    "text": "Da ich meine Website als Privatperson aufziehen möchte ist diese nicht immer gut geeignet für Bewerbungen. Daher habe ich dieses Portfolio erstellt.",
    "alt": "Screenshot meines Portfolios"
  },
  "Mello": {
    "name": "Mello",
    "text": "Mello war mein erstes großes Software Projekt. Im Informatik Unterricht der 11. Klasse hatten wir die aufgabe uns eine Idee für eine Software auszudenken und diese dann umzusetzen. Zusammen mit Robert Cuzio, Kevin Komm und Hannah Boldt entwickelten wir eine Social Media Website und nannten sie 'Mello'. Die Funktionen der Website konnten durch Module erweitert werden. Wir bauten also sozusagen ein kleines eigenes Framework! Ohne zu wissen was ein Framework ist. Entsprechend gealtert ist die Code-Basis heute. Das Design ist ebenfalls komplett selbst gemacht. Im Ordner 'docs' des Repositories haben wir auch eine Projektdokumentation und Präsentation hinterlassen.",
    "alt": "Screenshot von Mello"
  },
  "21": {
    "name": "Veintiuno Spiel",
    "text": "Warum heißt es Veintiuno? Ich weiß es nicht. Wir haben es einfach so genannt. Dieses Projekt habe ich zusammen mit Moritz Scheele, Nicole Günter, Philipp Wussow, Ole Ofterdinger, Nina Warneke und Christopher Lohse als ein Kursexamen entwickelt. Hier habe ich zum ersten mal ein Frontend Framework wie React benutzt.",
    "alt": "Screenshot der Veintiuno Landing Page"
  },
  "Click": {
    "name": "Simon Clicks",
    "text": "Simon Clicks habe ich zusammen mit meinem Freund Simon Hergersberg aus langeweile geschrieben. Wir hatten ein wenig Spaß mit verschiedenen JavaScript und CSS attributen und daraus ist dieses kleine Spiel entstanden. Zwischenzeitlich nutzte ich es um meine Hand-Augen-Koordination zu verbessern.",
    "alt": "Screenshot des Startbildschirms von Simon Clicks"
  },
  "PW": {
    "name": "Mein Passwort Generator",
    "text": "Nein, ich stelle hier nicht meine Passwörter online. Dieser Generator geniert lediglich Passwörter nach einem bestimmten Schema was sich leicht zu merken aber schwer zu knacken ist. Natürlich gilt trotzdem: Ein langes zufallgeneriertes Passwort ist deutlich sicherer. Im Passwort Generator konnte ich mein Vorwissen aus dem Bereich Verschlüsselungen anwenden. Außerdem gab mir dies die Gelegenheit mich mehr mit dem Thema Passwortsicherheit auseinander zu setzen.",
    "alt": "Screenshot des Passwort Generators"
  },
  "Cryptions": {
    "name": "Cryptions",
    "text": "Hier habe ich einige Verschlüsselungsmethoden zusammen getragen die ich nach und nach implementiert habe, unter anderem eine Verschlüsselung die ich mit meiner guten Freundin Janina Adamcic erfunden habe. Das Thema Verschlüsselungen hat mich zuerst 2017 interessiert als ich Zuhause programmieren mit Python lernte. In der Zeit legte ich auch die Grundsteine meines Passwort Generators. 2018 hatten wir das Thema dann im Unterricht näher behandelt, wodurch ich später unter anderem darüber mein Abitur schreiben konnte.",
    "alt": "Screenshot der Cryptions Seite"
  },
  "Platzhirsch": {
    "name": "Der neue Platzhirsch",
    "text": "Der neue Platzhirsch ein Restaurant in Berlin-Wedding. Zusammen mit Moritz Scheele habe ich diese Website für das Restaurant entwickelt. Heute wird sie relativ häufig aufgerufen dank SEO Optimierung.",
    "alt": "Screenshot der Webseite"
  },
  "IV": {
    "name": "Interest Validator",
    "text": "Der Interest Validator ist ein Programm was ich auf der Basis der Idee meines Vaters Dirk Hölzer entwickelt habe. Es ist ein Zinstesttool welches vorallem in Wirtschaftsprüfungen wie EY oder PWC eingesetzt wird. Dies war mein erstes großes Python Projekt und ich lernte viel über Interfaces, Threads und vieles mehr."
  },
  "W4PT": {
    "name": "Watson 4 Public Tenders",
    "text": "In meinem ersten Praxiseinsatz bei IBM bei Digital Sales arbeitete ich am bestehendem Projekt Watson 4 Public Tenders mit, welches interne Prozesse mit Hilfe von Watson Natural Language Processing Services automatisiert. Dabei trainierte ich Machine Learning Modelle und optimierte das bestehende Programm."
  },
  "W4PGMP": {
    "name": "Watson 4 PGMP",
    "text": "Ähnlich wie beim Watson 4 Public Tenders nutzt der Watson 4 PGMP IBM Watson Natural Language Processing (NLP) Services. Ich entwickelte ein Dashboard welche auf die Daten des NLP Services zugreift und diese auswertet. In diesem Projekt nutzte ich zum ersten Mal intensiv die Grafikbibliothek Plotly, sowie Komponenten des IBM Carbon Designs."
  },
  "SwarmViz": {
    "name": "Swarm Visualization",
    "text": "Hierbei handelt es sich um mein Project zu meiner 1. Praxisarbeit. Im IBM Watson Center in München erstellte ich eine Visualisierung welche eine Schwarm Intelligenz erklären sollte. Dies soll dazu führen, dass Menschen mehr vertrauen in diese bekommen wenn sie diese besser verstehen können. Hierbei arbeitete ich mit den JavaScript Frameworks Nest und Vue, nutzte Plotly und Carbon Components für die Visualisierung und lernte sehr viel über Schnittstellen und Clean-Coding Best-Practices kennen."
  }
}
