{
  "SNA": {
    "name": "Tobis Twitter Netzwerk",
    "text": "Dies ist ein Projekt welches ich im Zuge des Kurses 'Social Network Analysis' zusammen mit Christopher Lohse durchgeführt habe. Wir haben uns die Frage gestellt: 'Welche Twitter Accounts beeinflussen meinen Feed am meisten?'. Um diese Frage zu beantworten haben wir Methoden der Social Network Analyse benutzt. In diesem Projekt erweiterte ich meine Kentnisse in Python und Jupyter Notebook und lernte zusätzlich noch die Methoden der Social Network Analyse kennen.",
    "alt": "Social Network Graph"
  },
  "MyHome": {
    "name": "Meine Homepage",
    "text": "Meine Homepage habe entwickelt um mich mit ihrer Hilfe bei IBM für ein Duales Studium zu bewerben. Zum Glück habe ich den Job auch bekommen, vielleicht hat mir die Homepage dabei geholfen. Auf meiner Homepage stelle ich mich selbst der weiten Welt vor. Einen eigenen Blog habe ich dort auch, welchen ich selbst geschrieben habe. Die Website zu entwickeln war großartig, ich habe sehr viel über Webentwicklung lernen können. Außerdem konnte ich viel über Cloudentwicklung lernen, da ich die Homepage zuerst auf meinem Raspberry Pi und später auf der IBM Cloud gehostet habe.",
    "alt": "Screenshot meiner Homepage"
  },
  "ReactPrasi": {
    "name": "React Präsentation",
    "text": "Meine Freunde Christopher Lohse, Philipp Wussow und ich haben diese Seite als Webseite für eine Präsentation über das Framework React entwickelt. Wir wollten zeigen wie einfach es mit Frameworks ist eine gutaussehende Website zu entwickeln.",
    "alt": "Screenshot der Präsentation"
  },
  "CCT": {
    "name": "Cupboard Configuration Tool (CCT)",
    "text": "Den CCT habe ich zusammen mit meinen Freunden Christopher Lohse, Philipp Wussow, Ole Ofterdinger und Amon Schneider entwickelt. Dieses Projekt entstant im Zuge einer Projektsimulation. Bei dieser Simulation hatten verschiedene Teams aus dem Kurs die Aufgabe einen Online-Shop zu entwickeln unter weiteren verschiedenen Bedingungen. Zum Beispiel, dass unsere Dozenten für die Projektdauer in die Kundenrolle wechselten. In diesem Projekt vervollständigte ich mein Wissen über Webentwicklung durch das erlernen neuer Technologieen wie zum Beispiel i18n oder PWA.",
    "alt": "Screenshot des CCTs"
  },
  "DSVIZ": {
    "name": "Flights Dashboard",
    "text": "Zusammen mit Philipp Wussow habe ich dieses kleine Dashboard entwickelt, welches auf die Flugdaten aus Amerika im Jahre 2015 zugreift. Das Dashboard entstand im Zuge des Kurses 'Data Science Visualizations' als Prüfungsabgabe. Hier lernte ich vorallem mit Karten-Visualisierungen umzugehen.",
    "alt": "Screenshot des Dahboards"
  },
  "MyPort": {
    "name": "Mein Portfolio",
    "text": "Da ich meine Website als Privatperson aufziehen möchte ist diese nicht immer gut geeignet für Bewerbungen. Daher habe ich dieses Portfolio erstellt.",
    "alt": "Screenshot meines Portfolios"
  },
  "Mello": {
    "name": "Mello",
    "text": "Mello war mein erstes großes Software Projekt. Im Informatik Unterricht der 11. Klasse hatten wir die aufgabe uns eine Idee für eine Software auszudenken und diese dann umzusetzen. Zusammen mit Robert Cuzio, Kevin Komm und Hannah Boldt entwickelten wir eine Social Media Website und nannten sie 'Mello'. Die Funktionen der Website konnten durch Module erweitert werden. Wir bauten also sozusagen ein kleines eigenes Framework! Ohne zu wissen was ein Framework ist. Entsprechend gealtert ist die Code-Basis heute. Das Design ist ebenfalls komplett selbst gemacht. Im Ordner 'docs' des Repositories haben wir auch eine Projektdokumentation und Präsentation hinterlassen.",
    "alt": "Screenshot von Mello"
  },
  "21": {
    "name": "Veintiuno Spiel",
    "text": "Warum heißt es Veintiuno? Ich weiß es nicht. Wir haben es einfach so genannt. Dieses Projekt habe ich zusammen mit Moritz Scheele, Nicole Günter, Philipp Wussow, Ole Ofterdinger, Nina Warneke und Christopher Lohse als ein Kursexamen entwickelt. Hier habe ich zum ersten mal ein Frontend Framework wie React benutzt.",
    "alt": "Screenshot der Veintiuno Landing Page"
  }
}
