{
  "SNA": {
    "name": "Tobis Twitter Network",
    "text": "This is a project about My Twitter Network. I worked on this project together with Christopher Lohse. The question we asked ourselves was: 'Which people (accounts) are influencing Tobis Feed the most?'. To answer this question we used methods of the Social Network Analysis. In this project I increased my Python skills and learned how to create a Social Network Analysis.",
    "alt": "Social Network Graph"
  },
  "MyHome": {
    "name": "My Homepage",
    "text": "I build my Homepage to apply for an apprenticeship @ IBM. Gladly i got the job, maybe my Homepage has helped my a little bit out here. On my Homepage I present myself to everybode out there. I also wrote an own Blog-Engine and some articles on it. To build an own Homepage was great, I learned a lot about Web Development. Since I also hosted it on my Raspberry Pi and later on the IBM Cloud I also learned about the importance of Cloud Development.",
    "alt": "Screenshot of my Homepage"
  },
  "ReactPrasi": {
    "name": "React Presentation",
    "text": "For a presentation about the React Framework in class me and my friends Christopher Lohse, Philipp Wussow created this website which should show the class how easy it is to create a good looking website.",
    "alt": "Screenshot of the Presentation"
  },
  "CCT": {
    "name": "Cupboard Configuration Tool (CCT)",
    "text": "I developed the CCT together with my friends Christopher Lohse, Philipp Wussow, Ole Ofterdinger and Amon Schneider. This project was a project-simulation in class. Our teachers played as our customers and hired us to develop a Web-Shop for them. I nearly finished my road to be a full-stack web developer with this project. I learned a lot of new technologies like i18n or PWA.",
    "alt": "Screenshot of the CCT"
  },
  "DSVIZ": {
    "name": "Flights Dashboard",
    "text": "I developed this dashboard together with Philipp Wussow for a class exam. The dashboard takes data from 2015 american flights and visualize it. This was the first project where I visualized a map.",
    "alt": "Screenshot of the Dahboards"
  },
  "MyPort": {
    "name": "My Portfolio",
    "text": "Since my Homepage isn't build for business only purpose it isn't always the best choice to show it for job applications. Therefore I build this portfolio.",
    "alt": "Screenshot of my Portfolios"
  },
  "Mello": {
    "name": "Mello",
    "text": "Mello was my first big project. In 11th class we had the task to create a software idea und implement it. Myself and my collegues Robert Cuzio, Kevin Komm and Hannah Boldt created together a Social Media Website and called it 'Mello'. The functionality of the website could be increased with modules, we created a simple framework without knowing it! This is also what our code base looks like today! We also created the complete Design from scratch. The 'docs' folder of the repository contains a project documentation and presentation.",
    "alt": "Screenshot of Mello"
  }
}
