{
  "hostedAt": "Hosted",
  "internal": "Since this project is classified as confidential I am not allowed to provide a public link to it or show screenshots of it.",
  "notActive": "Currently not available",
  "SNA": {
    "name": "Tobis Twitter Network",
    "text": "This is a project about my Twitter network. I worked on this together with Christopher Lohse. The question we asked ourselves was: 'Which people are influencing Tobis Feed the most?'. Here I increased my Python skills and learned how to create a social network analysis.",
    "alt": "Social Network Graph"
  },
  "MyHome": {
    "name": "My Homepage",
    "text": "I build my Homepage to apply for an apprenticeship @ IBM. I am glad to say that I got the job and who knows, maybe my Homepage was the deciding factor. On it I present myself to everybody out there. I also wrote an own Blog-Engine and some posts on it. Building this was great and I learned a lot about Web Development and Cloud Development, since I also hosted it on my Raspberry Pi and later on the IBM Cloud.",
    "alt": "Screenshot of my Homepage"
  },
  "ReactPrasi": {
    "name": "React Presentation",
    "text": "During a lecture about Web Development my friends Christopher Lohse, Philipp Wussow and I created this website to showcase how easy it is to create a good looking website.",
    "alt": "Screenshot of the Presentation"
  },
  "CCT": {
    "name": "Cupboard Configuration Tool (CCT)",
    "text": "I developed the CCT together with my friends Christopher Lohse, Philipp Wussow, Ole Ofterdinger and Amon Schneider. This project was a university simulation. Our lecturers posed as our customers and hired us to develop a Web-Shop for them. I worked on this project full-stack and learned a lot of new technologies like internationalization or progressive web apps.",
    "alt": "Screenshot of the CCT"
  },
  "DSVIZ": {
    "name": "Flights Dashboard",
    "text": "I developed this dashboard together with Philipp Wussow for a university exam. It takes data american flights 2015 and visualizes it. This was the first project where I visualized a map.",
    "alt": "Screenshot of the Dahboards"
  },
  "MyPort": {
    "name": "My Portfolio",
    "text": "Since my Homepage isn't build for business purposes only, it isn't always the best choice to use it for job applications. I therefore build this portfolio.",
    "alt": "Screenshot of my Portfolios"
  },
  "Mello": {
    "name": "Mello",
    "text": "Mello was my first big project. In 11th grade we had the task to create a software idea und implement it. My peers Robert Cuzio, Kevin Komm, Hannah Boldt and I created a social media website and called it 'Mello'. The user can increase the functionality of the website by adding more modules to it. That means that we created a simple framework without knowing it. We also created the complete Design from scratch.",
    "alt": "Screenshot of Mello"
  },
  "21": {
    "name": "Veintiuno Game",
    "text": "Why did we called Veintiuno? I don't know. Together with Moritz Scheele, Nicole Günter, Philipp Wussow, Ole Ofterdinger, Nina Warneke and Christopher Lohse I developed this little game as an exam project. This was the first time I used a frontend Framework like React.",
    "alt": "Screenshot of the Veintiuno Landing Page"
  },
  "Click": {
    "name": "Simon Clicks",
    "text": "Together with my friend Simon Hergersberg I developed this mini-game. We just had fun with some JS and CSS code. I sometimes use this game to improve my hand-eye coordination.",
    "alt": "Screenshot of Simon Clicks"
  },
  "PW": {
    "name": "My Password Generator",
    "text": "No, you can't see my passwords there. This generator just generates a password after a specific algorithm which is easy to remember but hard to hack. However, a complete random Password would be more secure. I was able to use my knowledge about encryption techniques in this project. I also learned a lot about password security.",
    "alt": "Screenshot of the Password Generator"
  },
  "Cryptions": {
    "name": "Cryptions",
    "text": "This is a collection of some encryption methods which I implemented. One of them I developed together with my friend Janina Adamcic. The topic encryptions started to interest me in 2017 when I started to learn Python. At this time I also started to create my Password Generator.",
    "alt": "Screenshot of the Cryptions Page"
  },
  "Platzhirsch": {
    "name": "Der neue Platzhirsch",
    "text": "'Der neue Platzhirsch' is a restaurant in Berlin-Wedding. Together with my friend Moritz Scheele I developed this Website for the Restaurant. The Websites traffic is increased with Search Engine Optimization.",
    "alt": "Screenshot of the Webpage"
  },
  "IV": {
    "name": "Interest Validator",
    "text": "The Interest Validator is an application which I developed based on the idea of my father Dirk Hölzer of an automatic interest testing tool for accounting certifiers like EY or PWC. This was my first big project in Python and I learned a lot about user interfaces, concurrency and more."
  },
  "W4PT": {
    "name": "Watson 4 Public Tenders",
    "text": "In my first internship at IBM in the Digital Sales team I worked on the Watson 4 Public Tenders project where the Watson Natural Language Processing Services are used to categorize public tenders to automate intern processes. I trained Machine learning models and optimized the existing project."
  },
  "W4PGMP": {
    "name": "Watson 4 PGMP",
    "text": "Similar to the Watson 4 Public Tenders the Watson 4 PGMP uses IBM Watson Natural Language Processing (NLP) Services. I developed a Dashboard which uses the analyzed data from the NLP. In this project I used Plotly for the first time aswell as IBM Carbon Components."
  },
  "SwarmViz": {
    "name": "Swarm AI Visualization",
    "text": "In the IBM Watson Center in Munich I developed a visualization which explains a swarm intelligence easily. This enables humans to place trust in AI. For this I used Plotly, Carbon Components and worked with the JavaScript frameworks Nest and Vue. Within the project I learned a lot about APIs and Clean-Coding best practices."
  },
  "DataExploration": {
    "name": "Data Exploration Project",
    "text": "In the Data Exploration Project Philipp Wussow, Ole Ofterdigner, Amon Schneider, Hajdar Razawi and I worked on a 'Win Rate' prediction model for the video game League of Legends. This prediction model should help e-sport analysts making their predictions about coming games. This project was part of our 'Data Exploration' lecture at our university."
  },
  "ACCEL": {
    "name": "Entity-Linking Model",
    "text": "ACCEL is the entity linking model that I developed during my 4th practice assignment at IBM. I also wrote my 2nd practice paper about this model. The model can be trained with machine learning methods to solve the entity linking problem. This problem is a Natural Language Processing (NLP) problem, it describes the linking of an entity in a text with the corresponding database entry. Among other things, ACCEL uses the very strong BERT transformers from Google."
  },
  "TooManyTrees": {
    "name": "Weather-Data analysis about deforestation in Europe",
    "text": "In the course of my 5th practical assignment at IBM, I investigated the influence of droughts on forest dieback in Europe. Due to the short duration of the project, I was not able to deliver relevant results, but I learned a lot about data science in practice. At this time I decided to focus on environmental and climate issues."
  },
  "Tannder": {
    "name": "Tannder",
    "text": "For the subject Software Engineering my fellow students Philipp Wussow, Ole Ofterdinger, Amon Schneider and I developed the app 'Tannder'. The task was to develop a simple multiservice app using the JS framework Ionic. In the app, users can upload pictures of their Christmas trees and rate the Christmas trees of other users, resulting in a viewable ranking based on the official chess ELO system."
  },
  "FloodDetection": {
    "name": "SotA Flood Detection Modell",
    "text": "This project is the project for my bachelor thesis. I trained and optimized existing AI models and adapted them to the task of detecting floods and high tides on satellite data. For this purpose, I investigated various aspects of the models and the underlying training data such as normalization, hyperparameters or modalities. The final model performed better than existing research models, so I am very proud to have contributed to the State of the Art (SotA)."
  },
  "CEK": {
    "name": "Car Evaluation Kit",
    "text": "For the Formula Student Team DHBW Engineering I developed a tool for logging the application phase, which provides not only the logging but also the resulting calculation for engineers. This made it possible for us as a team to save 8 working hours per week when adjusting the driving dynamics of the race car. In addition, the logging data was organized and systematically stored, making it possible for us as a team to perform larger meta-analyses for the first time. During the development of the tool I used modern technologies like GraphqQL, Prisma and TypeScript, which on the one hand allows the tool to be extended safely and very quickly and on the other hand allowed me to further expand my tech-stack."
  },
  "eSleek": {
    "name": "eSleek 22",
    "text": "In my last year at the DHBW I was part of the DHBW Engineering. The engineering is a student association which builds a real, electric race car and participates in Formula Student competitions worldwide. There I learned a lot about mechanical and electrical engineering for a computer scientist. Besides my main work package (the Car Evaluation Kit) I also developed new concepts for the storage of our measurement data, did vehicle dynamics data analysis with Matlab, developed a localisation algorithm for the driverless-software and helped my comrades with everyday tasks like the production of carbon parts."
  },
  "ChaoticCarbonNetworks": {
    "name": "Identification of regions with a high responsiveness to anthropogenic carbon emissions",
    "text": "Uni project in which I used complex networks to investigate which regions of the world react particularly strongly to anthropogenic carbon emissions. I generated a complex network based on two global datasets using the mutual information method and analyzed it for degree centrality and average link length. Grade: 1.0"
  },
  "Stopuhr": {
    "name": "Stopuhr",
    "text": "A Python library to measure the duration of code blocks in a pipeline. Very rudimentary, as it is just a simple wrapper around Python's 'time'. I wanted to test how to create and publish a Python library."
  },
  "DARTS": {
    "name": "DARTS-nextgen",
    "text": "DARTS-nextgen is an image segmentation pipeline to detect swamps in permafrost regions using satellite images. The project is part of my work at the Alfred Wegener Institute and originates from the work of Dr. Ingmar Nitze and Dr. Konrad Heidler. I have rewritten and optimized the pipeline to make it more scalable."
  },
  "SmartGeocubes": {
    "name": "Smart Geocubes",
    "text": "A Python library that makes it easier to download geodata. The library was created during my work on the DARTS-nextgen pipeline and was outsourced by me to support other projects as well."
  },
  "SpatStatProject": {
    "name": "Risk-Based Mapping of Arsenic Contamination in Bangladesh: A Geostatistical Approach using Indicator Simulation and Kriging",
    "text": "Uni project which I did together with my fellow students Florian Josephowitz and Ben Lefebvre for the course Spatial Statistics and Models at the University of Potsdam. We implemented our own kriging models in Python and applied them to a given data set on arsenic concentrations in Bangladesh."
  }
}
