{
  "PA1": {
    "name": "1. Project Thesis",
    "text": "This is my first scientific paper through which I learned a lot about the scientific process. My topic was 'UI / UX requirements for explainable and trustful AI systems'."
  },
  "SSP": {
    "name": "Rock Paper Scissors",
    "text": "This is my very first Software Project. In 10th grade in school we had the task to code a simple scissors paper rock game in Python (2!). I had so much fun coding this, that I continued to add more and more functionality in my freetime e.g. the entities Lizzard and Spock in order to create Rock Paper Scissors Lizzard Spock game from the TV Show Big Bang Theory. It should still work with Python Version 2.6. I think that without this project I wouldn't be where I am today."
  },
  "5PK": {
    "name": "5. Component of Highschool Exam",
    "text": "The 5. Pk is part of the Berliner Abitur. The students must hold a presentation infront of a comitee. This is my presentation about Technocracy vs Democracy."
  },
  "MSA": {
    "name": "MSA",
    "text": "The MSA are the Berliner Middle School Exams. In 10th grade I held this presentation together with Jurek Urbach about 'The energy production of tomorrow' as one of the MSA exams."
  },
  "CV": {
    "name": "CV",
    "text": "My current CV, version from 27th April 2025."
  },
  "PA2": {
    "name": "2. Project Thesis",
    "text": "I wrote my second scientific paper about Entity-Linking and AI. This time I was able to use my gained knowledge about scientific methods. Unfortunately my proposed machine learning model was not able to solve the Entity-Linking problem."
  },
  "BA": {
    "name": "Bachelor Thesis",
    "text": "I wrote my bachelor thesis on automatic flood detection using satellite data in spring 2022 at the IBM research lab in Zurich. My research included the comparison and optimization of different models based on machine learning. It was possible for me to outperform the accuracy of existing models in current research through the targeted application of optimizations."
  }
}